src/cf/src/Documents/ПередачаВПереработку/ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВПереработку</name>
  <basedOn>Document.ВыпускПродукции</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПереработке</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <comment>Полуфабрикат или готовая продукция заказа, для которой передаётся материал (2.0.16.16); пусто - по правилу заказа</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <comment>Сколько ПФ/ГП ожидается из материала строки, в базовых единицах ПФ/ГП (2.0.16.17); 0 - по правилу заказа</comment>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ПередачаВПереработку/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		ЗаполнитьОжидаемуюПродукциюПоЗаказу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
		ЗаполнитьПоВыпускуПродукции(ДанныеЗаполнения);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки: сначала читаются остатки склада, затем пишется приход у переработчика
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	УправляемыеБлокировки.ТоварыВПереработке(Блокировка, ТЧТовары, Контрагент);
	Блокировка.Заблокировать();
	// Формируем: списание со склада и приход в переработку - в диспетчере ТоварыВНаличии
	Если Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Движения.Записать();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Контрагент)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Субподрядчик") <> Истина Тогда
		ТекстОшибки = НСтр("ru = 'Контрагент не помечен как субподрядчик (переработчик)';
			|fr = 'Le partenaire n''est pas marqué comme sous-traitant';
			|en = 'The counterparty is not marked as a subcontractor (processor)';
			|es = 'La contraparte no está marcada como subcontratista (procesador)'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Контрагент", , Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Если Не Отказ И Не ЭтоНовый() Тогда
		ПроверитьСменуОснованияИПереработчика(Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.ОбновитьПроизводственныйСтатусЗаказа(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОжидаемуюПродукциюПоЗаказу(Заказ)
	// В ожидаемую продукцию попадают строки заказа с продукцией и полуфабрикатами; типы берутся одним запросом.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.Упаковка КАК Упаковка,
	                      |	ТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ТЧТовары.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.ЗаказПокупателя.ТЧТовары КАК ТЧТовары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧТовары.Номенклатура = СправочникНоменклатура.Ссылка
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Заказ
	                      |	И СправочникНоменклатура.ТипНоменклатуры В (&ТипыПродукции)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТЧТовары.НомерСтроки");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ТипыПродукции", ТипыПродукции());
	ТЧГотоваяПродукция.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого Стр Из ТЧГотоваяПродукция Цикл
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(ТЧГотоваяПродукция);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПоВыпускуПродукции(Выпуск)
	// Выпущенные полуфабрикаты передаются на переработку со склада оприходования выпуска;
	// ожидаемая продукция - из заказа-основания выпуска.
	// Имена реквизитов - без пробелов: ЗначенияРеквизитовОбъекта делает из них ключи структуры как есть.
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выпуск,
		"Основание,Организация,МестоХраненияОприходование,СозданАвтоматически");
	// У автовыпуска основание - не заказ: ожидаемая продукция берётся из заказа этого основания (E9).
	// Признак, а не тип основания: с появлением второго типа основания (S4-B) проверка по типу увела бы
	// сюда саму передачу-родителя вместо заказа. Реквизит читается тем же запросом, лишнего чтения нет.
	// Проверка типа, а не ЗначениеЗаполнено: к Булеву та возвращает Истину и на Ложь (tiny1C bsl-017),
	// а у несуществующей ссылки реквизит приходит как Неопределено.
	Если ТипЗнч(Реквизиты.СозданАвтоматически) = Тип("Булево") И Реквизиты.СозданАвтоматически Тогда
		Основание = Производство.ЗаказРеализацииОснования(Реквизиты.Основание);
	Иначе
		Основание = Реквизиты.Основание;
	КонецЕсли;
	Организация = Реквизиты.Организация;
	Если ЗначениеЗаполнено(Реквизиты.МестоХраненияОприходование) Тогда
		МестоХранения = Реквизиты.МестоХраненияОприходование;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТЧ.Номенклатура КАК Номенклатура,
	                      |	ТЧ.Характеристика КАК Характеристика,
	                      |	ТЧ.Серия КАК Серия,
	                      |	ТЧ.Упаковка КАК Упаковка,
	                      |	ТЧ.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ТЧ.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.ВыпускПродукции.ТЧГотоваяПродукция КАК ТЧ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧ.Номенклатура = СправочникНоменклатура.Ссылка
	                      |ГДЕ
	                      |	ТЧ.Ссылка = &Выпуск
	                      |	И СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Полуфабрикат)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТЧ.НомерСтроки");
	Запрос.УстановитьПараметр("Выпуск", Выпуск);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(ТЧТовары);
	КонецЦикла;
	Если ЗначениеЗаполнено(Основание) Тогда
		ЗаполнитьОжидаемуюПродукциюПоЗаказу(Основание);
	КонецЕсли;
КонецПроцедуры

// Заказ и переработчик передачи, по которой есть проведённые поступления из переработки или по партиям которой уже
// списывали, не меняются: иначе поступившая продукция засчиталась бы другому заказу без пересчёта стадий, а остаток у
// переработчика ушёл бы в минус (E12.3b).
//
// Параметры:
//  Отказ - Булево - устанавливается при смене.
//
Процедура ПроверитьСменуОснованияИПереработчика(Отказ)
	Прежние = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Основание, Контрагент");
	Если Прежние.Основание = Основание И Прежние.Контрагент = Контрагент Тогда
		Возврат;
	КонецЕсли;
	Если Не РегистрыНакопления.ТоварыВПереработке.ЕстьСписаниеПоПередаче(Ссылка) И Не ЕстьПоступленияПоПередаче() Тогда
		Возврат;
	КонецЕсли;
	ТекстОшибки = НСтр("ru = 'По передаче уже поступала продукция из переработки: заказ и переработчик не меняются.';
		|fr = 'Des réceptions de sous-traitance existent pour ce transfert : la commande et le sous-traitant ne changent pas.';
		|en = 'Subcontracting receipts already exist for this transfer: the order and processor cannot change.';
		|es = 'Ya hay recepciones de subcontratación de este envío: el pedido y el procesador no cambian.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Основание", , Отказ);
КонецПроцедуры

// Возвращаемое значение:
//  Булево - есть проведённые поступления из переработки на основании передачи.
//
Функция ЕстьПоступленияПоПередаче()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Поступления.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеИзПереработки КАК Поступления
	                      |ГДЕ
	                      |	Поступления.Основание = &Передача
	                      |	И Поступления.Проведен");
	Запрос.УстановитьПараметр("Передача", Ссылка);
	// BSLLS:SetPrivilegedMode-off - наружу уходит только признак.
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция ТипыПродукции()
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ТипыНоменклатуры.Продукция);
	Результат.Добавить(Перечисления.ТипыНоменклатуры.Полуфабрикат);
	Возврат Результат;
КонецФункции

#КонецОбласти
